{
  "name": "Craig Miller",
  "contact": {
    "email": "craigmiller.software.engineer@gmail.com"
  },
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "institution": "Ramapo College of New Jersey"
    }
  ],
  "certifications": [
    "Oracle Certified Java Professional"
  ],
  "experience": [
    {
      "achievements": [
        "Spearheaded the design and implementation of a new Point of Care solution that leverages an API integration with major EMR providers, increasing client business by 10%.",
        "Led the transition of application suites from Pivotal CloudFoundry to Kubernetes-based Red Hat OpenShift, enhancing system scalability and maintainability.",
        "Enhanced enterprise CI/CD processes, resulting in a reduction of labor by over 8 hours per team member through automation and process improvement.",
        "Championed the introduction of TypeScript, significantly reducing bugs and stabilizing front-end applications.",
        "Developed and conducted an internal React training program, broadening the skill set of backend developers to encompass full stack capabilities.",
        "Standardized and streamlined software release processes, boosting release schedule adherence and reducing delays, thereby improving business predictability.",
        "Developed data synchronization pipelines utilizing Kafka to enable seamless operation between modern and mainframe applications, ensuring interoperability and accessibility of results across platforms."
      ],
      "company": "Cigna",
      "dates": "",
      "positions": [
        {
          "title": "Senior Software Engineer ",
          "dates": "March 2020 - Present"
        }
      ]
    },
    {
      "achievements": [
        "Developed an in-house ETL solution that eliminated reliance on costly, unreliable external platforms, optimizing data integration with mainframes.",
        "Initiated and led the adoption of a micro-frontend architecture, which enhanced the modularity and speed of frontend application deployments.",
        "Overhauled the frontend build system to reduce application size by 50%, markedly improving load times and user experience.",
        "Actively mentored interns, significantly contributing to talent acquisition as many interns transitioned to full-time roles."
      ],
      "company": "Cigna",
      "dates": "",
      "positions": [
        {
          "title": "Software Engineer ",
          "dates": "Dec 2018 - March 2020"
        }
      ]
    },
    {
      "achievements": [
        "Designed and implemented a cutting-edge electronic form integration solution for a legacy medical forms company, modernizing their operations and securing customer data.",
        "Created a flexible system for clients to map legacy data feeds to modern REST API calls, enhancing client service capabilities and competitive position.",
        "Engineered a solution for integrating regulatory data from multiple APIs into a single database, greatly improving the operational efficiency of a client in the insurance sector."
      ],
      "company": "PilotFish Technology",
      "dates": "",
      "positions": [
        {
          "title": "Solutions Architect ",
          "dates": "Dec 2016 - Dec 2018"
        }
      ]
    },
    {
      "achievements": [
        "Created an automated regression testing system that preemptively identified software upgrades' impacts, ensuring smooth transitions.",
        "Revamped UI code to optimize threading and process efficiency, resulting in superior responsiveness and user engagement."
      ],
      "company": "PilotFish Technology",
      "dates": "",
      "positions": [
        {
          "title": "Java Developer ",
          "dates": "Dec 2015 - Dec 2016"
        }
      ]
    }
  ],
  "honorsAndAchievements": [
    {
      "honor": "Eagle Scout",
      "institution": "Boy Scouts of America"
    }
  ],
  "intro": {
    "body": "With nearly a decade of software engineering expertise, I excel in designing, developing, and deploying transformative enterprise solutions. I am a strategic leader with a proven track record in enhancing operational efficiency, mentoring top-tier development teams, and driving significant business growth through technological innovation.",
    "title": "Principal/Staff/Senior Full Stack Engineer"
  },
  "skills": {
    "agileExperience": [
      "Scrum",
      "Kanban"
    ],
    "cloudDeployment": [
      "Docker",
      "Kubernetes",
      "CloudFoundry",
      "OpenShift",
      "AWS"
    ],
    "databases": [
      "PostgreSQL",
      "MySQL",
      "SQL Server",
      "Oracle",
      "MongoDB",
      "Flyway",
      "Liquibase",
      "Kafka",
      "Weaviate"
    ],
    "frameworksAndTools": [
      "SpringBoot",
      "Jersey/JAX-RS",
      "Maven",
      "Gradle",
      "Hibernate",
      "React",
      "Angular",
      "Vue",
      "Svelte",
      "NodeJS",
      "ExpressJS"
    ],
    "languages": [
      "Java",
      "JavaScript,",
      "HTML5/CSS3,",
      "TypeScript,",
      "Kotlin",
      "Scala",
      "SQL",
      "Bash",
      "XSLT"
    ]
  }
}